GopalSaraf/Practicals/PSDL/include/proc/pic18c601.h
// Register: PORTF
#define PORTF PORTF
extern volatile unsigned char           PORTF               __at(0xF85);
#ifndef _LIB_BUILD
asm("PORTF equ 0F85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF0                    :1;
        unsigned RF1                    :1;
        unsigned RF2                    :1;
        unsigned RF3                    :1;
        unsigned RF4                    :1;
        unsigned RF5                    :1;
        unsigned RF6                    :1;
        unsigned RF7                    :1;
    };
    struct {
        unsigned AN5                    :1;
        unsigned AN6                    :1;
        unsigned AN7                    :1;
        unsigned CSIO                   :1;
        unsigned A16                    :1;
        unsigned CS1                    :1;
        unsigned LB                     :1;
        unsigned UB                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned AD16                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned C2OUTF                 :1;
        unsigned C1OUTF                 :1;
    };
} PORTFbits_t;
extern volatile PORTFbits_t PORTFbits __at(0xF85);
// bitfield macros
#define _PORTF_RF0_POSN                                     0x0
#define _PORTF_RF0_POSITION                                 0x0
#define _PORTF_RF0_SIZE                                     0x1
#define _PORTF_RF0_LENGTH                                   0x1
#define _PORTF_RF0_MASK                                     0x1
#define _PORTF_RF1_POSN                                     0x1
#define _PORTF_RF1_POSITION                                 0x1
#define _PORTF_RF1_SIZE                                     0x1
#define _PORTF_RF1_LENGTH                                   0x1
#define _PORTF_RF1_MASK                                     0x2
#define _PORTF_RF2_POSN                                     0x2
#define _PORTF_RF2_POSITION                                 0x2
#define _PORTF_RF2_SIZE                                     0x1
#define _PORTF_RF2_LENGTH                                   0x1
#define _PORTF_RF2_MASK                                     0x4
#define _PORTF_RF3_POSN                                     0x3
#define _PORTF_RF3_POSITION                                 0x3
#define _PORTF_RF3_SIZE                                     0x1
#define _PORTF_RF3_LENGTH                                   0x1
#define _PORTF_RF3_MASK                                     0x8
#define _PORTF_RF4_POSN                                     0x4
#define _PORTF_RF4_POSITION                                 0x4
#define _PORTF_RF4_SIZE                                     0x1
#define _PORTF_RF4_LENGTH                                   0x1
#define _PORTF_RF4_MASK                                     0x10
#define _PORTF_RF5_POSN                                     0x5
#define _PORTF_RF5_POSITION                                 0x5
#define _PORTF_RF5_SIZE                                     0x1
#define _PORTF_RF5_LENGTH                                   0x1
#define _PORTF_RF5_MASK                                     0x20
#define _PORTF_RF6_POSN                                     0x6
#define _PORTF_RF6_POSITION                                 0x6
#define _PORTF_RF6_SIZE                                     0x1
#define _PORTF_RF6_LENGTH                                   0x1
#define _PORTF_RF6_MASK                                     0x40
#define _PORTF_RF7_POSN                                     0x7
#define _PORTF_RF7_POSITION                                 0x7
#define _PORTF_RF7_SIZE                                     0x1
#define _PORTF_RF7_LENGTH                                   0x1
#define _PORTF_RF7_MASK                                     0x80
#define _PORTF_AN5_POSN                                     0x0
#define _PORTF_AN5_POSITION                                 0x0
#define _PORTF_AN5_SIZE                                     0x1
#define _PORTF_AN5_LENGTH                                   0x1
#define _PORTF_AN5_MASK                                     0x1
#define _PORTF_AN6_POSN                                     0x1
#define _PORTF_AN6_POSITION                                 0x1
#define _PORTF_AN6_SIZE                                     0x1
#define _PORTF_AN6_LENGTH                                   0x1
#define _PORTF_AN6_MASK                                     0x2
#define _PORTF_AN7_POSN                                     0x2
#define _PORTF_AN7_POSITION                                 0x2
#define _PORTF_AN7_SIZE                                     0x1
#define _PORTF_AN7_LENGTH                                   0x1
#define _PORTF_AN7_MASK                                     0x4
#define _PORTF_CSIO_POSN                                    0x3
#define _PORTF_CSIO_POSITION                                0x3
#define _PORTF_CSIO_SIZE                                    0x1
#define _PORTF_CSIO_LENGTH                                  0x1
#define _PORTF_CSIO_MASK                                    0x8
#define _PORTF_A16_POSN                                     0x4
#define _PORTF_A16_POSITION                                 0x4
#define _PORTF_A16_SIZE                                     0x1
#define _PORTF_A16_LENGTH                                   0x1
#define _PORTF_A16_MASK                                     0x10
#define _PORTF_CS1_POSN                                     0x5
#define _PORTF_CS1_POSITION                                 0x5
#define _PORTF_CS1_SIZE                                     0x1
#define _PORTF_CS1_LENGTH                                   0x1
#define _PORTF_CS1_MASK                                     0x20
#define _PORTF_LB_POSN                                      0x6
#define _PORTF_LB_POSITION                                  0x6
#define _PORTF_LB_SIZE                                      0x1
#define _PORTF_LB_LENGTH                                    0x1
#define _PORTF_LB_MASK                                      0x40
#define _PORTF_UB_POSN                                      0x7
#define _PORTF_UB_POSITION                                  0x7
#define _PORTF_UB_SIZE                                      0x1
#define _PORTF_UB_LENGTH                                    0x1
#define _PORTF_UB_MASK                                      0x80
#define _PORTF_AD16_POSN                                    0x4
#define _PORTF_AD16_POSITION                                0x4
#define _PORTF_AD16_SIZE                                    0x1
#define _PORTF_AD16_LENGTH                                  0x1
#define _PORTF_AD16_MASK                                    0x10
#define _PORTF_C2OUTF_POSN                                  0x1
#define _PORTF_C2OUTF_POSITION                              0x1
#define _PORTF_C2OUTF_SIZE                                  0x1
#define _PORTF_C2OUTF_LENGTH                                0x1
#define _PORTF_C2OUTF_MASK                                  0x2
#define _PORTF_C1OUTF_POSN                                  0x2
#define _PORTF_C1OUTF_POSITION                              0x2
#define _PORTF_C1OUTF_SIZE                                  0x1
#define _PORTF_C1OUTF_LENGTH                                0x1
#define _PORTF_C1OUTF_MASK                                  0x4

// Register: PORTG
#define PORTG PORTG
extern volatile unsigned char           PORTG               __at(0xF86);
#ifndef _LIB_BUILD
asm("PORTG equ 0F86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG0                    :1;
        unsigned RG1                    :1;
        unsigned RG2                    :1;
        unsigned RG3                    :1;
        unsigned RG4                    :1;
    };
    struct {
        unsigned ALE                    :1;
        unsigned OE                     :1;
        unsigned WRL                    :1;
        unsigned WRH                    :1;
        unsigned BA0                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned C3OUTG                 :1;
    };
} PORTGbits_t;
extern volatile PORTGbits_t PORTGbits __at(0xF86);
// bitfield macros
#define _PORTG_RG0_POSN                                     0x0
#define _PORTG_RG0_POSITION                                 0x0
#define _PORTG_RG0_SIZE                                     0x1
#define _PORTG_RG0_LENGTH                                   0x1
#define _PORTG_RG0_MASK                                     0x1
#define _PORTG_RG1_POSN                                     0x1
#define _PORTG_RG1_POSITION                                 0x1
#define _PORTG_RG1_SIZE                                     0x1
#define _PORTG_RG1_LENGTH                                   0x1
#define _PORTG_RG1_MASK                                     0x2
#define _PORTG_RG2_POSN                                     0x2
#define _PORTG_RG2_POSITION                                 0x2
#define _PORTG_RG2_SIZE                                     0x1
#define _PORTG_RG2_LENGTH                                   0x1
#define _PORTG_RG2_MASK                                     0x4
#define _PORTG_RG3_POSN                                     0x3
#define _PORTG_RG3_POSITION                                 0x3
#define _PORTG_RG3_SIZE                                     0x1
#define _PORTG_RG3_LENGTH                                   0x1
#define _PORTG_RG3_MASK                                     0x8
#define _PORTG_RG4_POSN                                     0x4
#define _PORTG_RG4_POSITION                                 0x4
#define _PORTG_RG4_SIZE                                     0x1
#define _PORTG_RG4_LENGTH                                   0x1
#define _PORTG_RG4_MASK                                     0x10
#define _PORTG_ALE_POSN                                     0x0
#define _PORTG_ALE_POSITION                                 0x0
#define _PORTG_ALE_SIZE                                     0x1
#define _PORTG_ALE_LENGTH                                   0x1
#define _PORTG_ALE_MASK                                     0x1
#define _PORTG_OE_POSN                                      0x1
#define _PORTG_OE_POSITION                                  0x1
#define _PORTG_OE_SIZE                                      0x1
#define _PORTG_OE_LENGTH                                    0x1
#define _PORTG_OE_MASK                                      0x2
#define _PORTG_WRL_POSN                                     0x2
#define _PORTG_WRL_POSITION                                 0x2
#define _PORTG_WRL_SIZE                                     0x1
#define _PORTG_WRL_LENGTH                                   0x1
#define _PORTG_WRL_MASK                                     0x4
#define _PORTG_WRH_POSN                                     0x3
#define _PORTG_WRH_POSITION                                 0x3
#define _PORTG_WRH_SIZE                                     0x1
#define _PORTG_WRH_LENGTH                                   0x1
#define _PORTG_WRH_MASK                                     0x8
#define _PORTG_BA0_POSN                                     0x4
#define _PORTG_BA0_POSITION                                 0x4
#define _PORTG_BA0_SIZE                                     0x1
#define _PORTG_BA0_LENGTH                                   0x1
#define _PORTG_BA0_MASK                                     0x10
#define _PORTG_C3OUTG_POSN                                  0x1
#define _PORTG_C3OUTG_POSITION                              0x1
#define _PORTG_C3OUTG_SIZE                                  0x1
#define _PORTG_C3OUTG_LENGTH                                0x1
#define _PORTG_C3OUTG_MASK                                  0x2

