GopalSaraf/Practicals/PSDL/include/proc/pic18c601.h
extern volatile CSELIObits_t CSELIObits __at(0xFA6);
// bitfield macros
#define _CSELIO_CSIO_POSN                                   0x0
#define _CSELIO_CSIO_POSITION                               0x0
#define _CSELIO_CSIO_SIZE                                   0x8
#define _CSELIO_CSIO_LENGTH                                 0x8
#define _CSELIO_CSIO_MASK                                   0xFF
#define _CSELIO_CSIO0_POSN                                  0x0
#define _CSELIO_CSIO0_POSITION                              0x0
#define _CSELIO_CSIO0_SIZE                                  0x1
#define _CSELIO_CSIO0_LENGTH                                0x1
#define _CSELIO_CSIO0_MASK                                  0x1
#define _CSELIO_CSIO1_POSN                                  0x1
#define _CSELIO_CSIO1_POSITION                              0x1
#define _CSELIO_CSIO1_SIZE                                  0x1
#define _CSELIO_CSIO1_LENGTH                                0x1
#define _CSELIO_CSIO1_MASK                                  0x2
#define _CSELIO_CSIO2_POSN                                  0x2
#define _CSELIO_CSIO2_POSITION                              0x2
#define _CSELIO_CSIO2_SIZE                                  0x1
#define _CSELIO_CSIO2_LENGTH                                0x1
#define _CSELIO_CSIO2_MASK                                  0x4
#define _CSELIO_CSIO3_POSN                                  0x3
#define _CSELIO_CSIO3_POSITION                              0x3
#define _CSELIO_CSIO3_SIZE                                  0x1
#define _CSELIO_CSIO3_LENGTH                                0x1
#define _CSELIO_CSIO3_MASK                                  0x8
#define _CSELIO_CSIO4_POSN                                  0x4
#define _CSELIO_CSIO4_POSITION                              0x4
#define _CSELIO_CSIO4_SIZE                                  0x1
#define _CSELIO_CSIO4_LENGTH                                0x1
#define _CSELIO_CSIO4_MASK                                  0x10
#define _CSELIO_CSIO5_POSN                                  0x5
#define _CSELIO_CSIO5_POSITION                              0x5
#define _CSELIO_CSIO5_SIZE                                  0x1
#define _CSELIO_CSIO5_LENGTH                                0x1
#define _CSELIO_CSIO5_MASK                                  0x20
#define _CSELIO_CSIO6_POSN                                  0x6
#define _CSELIO_CSIO6_POSITION                              0x6
#define _CSELIO_CSIO6_SIZE                                  0x1
#define _CSELIO_CSIO6_LENGTH                                0x1
#define _CSELIO_CSIO6_MASK                                  0x40
#define _CSELIO_CSIO7_POSN                                  0x7
#define _CSELIO_CSIO7_POSITION                              0x7
#define _CSELIO_CSIO7_SIZE                                  0x1
#define _CSELIO_CSIO7_LENGTH                                0x1
#define _CSELIO_CSIO7_MASK                                  0x80

// Register: CSEL2
#define CSEL2 CSEL2
extern volatile unsigned char           CSEL2               __at(0xFA7);
#ifndef _LIB_BUILD
asm("CSEL2 equ 0FA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CSL                    :8;
    };
    struct {
        unsigned CSL0                   :1;
        unsigned CSL1                   :1;
        unsigned CSL2                   :1;
        unsigned CSL3                   :1;
        unsigned CSL4                   :1;
        unsigned CSL5                   :1;
        unsigned CSL6                   :1;
        unsigned CSL7                   :1;
    };
} CSEL2bits_t;
extern volatile CSEL2bits_t CSEL2bits __at(0xFA7);
// bitfield macros
#define _CSEL2_CSL_POSN                                     0x0
#define _CSEL2_CSL_POSITION                                 0x0
#define _CSEL2_CSL_SIZE                                     0x8
#define _CSEL2_CSL_LENGTH                                   0x8
#define _CSEL2_CSL_MASK                                     0xFF
#define _CSEL2_CSL0_POSN                                    0x0
#define _CSEL2_CSL0_POSITION                                0x0
#define _CSEL2_CSL0_SIZE                                    0x1
#define _CSEL2_CSL0_LENGTH                                  0x1
#define _CSEL2_CSL0_MASK                                    0x1
#define _CSEL2_CSL1_POSN                                    0x1
#define _CSEL2_CSL1_POSITION                                0x1
#define _CSEL2_CSL1_SIZE                                    0x1
#define _CSEL2_CSL1_LENGTH                                  0x1
#define _CSEL2_CSL1_MASK                                    0x2
#define _CSEL2_CSL2_POSN                                    0x2
#define _CSEL2_CSL2_POSITION                                0x2
#define _CSEL2_CSL2_SIZE                                    0x1
#define _CSEL2_CSL2_LENGTH                                  0x1
#define _CSEL2_CSL2_MASK                                    0x4
#define _CSEL2_CSL3_POSN                                    0x3
#define _CSEL2_CSL3_POSITION                                0x3
#define _CSEL2_CSL3_SIZE                                    0x1
#define _CSEL2_CSL3_LENGTH                                  0x1
#define _CSEL2_CSL3_MASK                                    0x8
#define _CSEL2_CSL4_POSN                                    0x4
#define _CSEL2_CSL4_POSITION                                0x4
#define _CSEL2_CSL4_SIZE                                    0x1
#define _CSEL2_CSL4_LENGTH                                  0x1
#define _CSEL2_CSL4_MASK                                    0x10
#define _CSEL2_CSL5_POSN                                    0x5
#define _CSEL2_CSL5_POSITION                                0x5
#define _CSEL2_CSL5_SIZE                                    0x1
#define _CSEL2_CSL5_LENGTH                                  0x1
#define _CSEL2_CSL5_MASK                                    0x20
#define _CSEL2_CSL6_POSN                                    0x6
#define _CSEL2_CSL6_POSITION                                0x6
#define _CSEL2_CSL6_SIZE                                    0x1
#define _CSEL2_CSL6_LENGTH                                  0x1
#define _CSEL2_CSL6_MASK                                    0x40
#define _CSEL2_CSL7_POSN                                    0x7
#define _CSEL2_CSL7_POSITION                                0x7
#define _CSEL2_CSL7_SIZE                                    0x1
#define _CSEL2_CSL7_LENGTH                                  0x1
#define _CSEL2_CSL7_MASK                                    0x80

